###############################################################################
# Created by write_sdc
# Wed Nov  6 01:02:33 2024
###############################################################################
current_design core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[0]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[0]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[10]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[10]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[11]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[11]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[12]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[12]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[13]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[13]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[14]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[14]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[15]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[15]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[16]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[16]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[17]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[17]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[18]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[18]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[19]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[19]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[1]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[1]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[20]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[20]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[21]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[21]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[22]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[22]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[23]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[23]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[24]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[24]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[25]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[25]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[26]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[26]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[27]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[27]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[28]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[28]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[29]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[29]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[2]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[2]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[30]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[30]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[31]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[31]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[3]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[3]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[4]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[4]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[5]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[5]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[6]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[6]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[7]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[7]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[8]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[8]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_instr_ID[9]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_instr_ID[9]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[0]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[0]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[10]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[10]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[11]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[11]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[12]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[12]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[13]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[13]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[14]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[14]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[15]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[15]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[16]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[16]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[17]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[17]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[18]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[18]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[19]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[19]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[1]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[1]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[20]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[20]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[21]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[21]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[22]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[22]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[23]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[23]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[24]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[24]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[25]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[25]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[26]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[26]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[27]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[27]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[28]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[28]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[29]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[29]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[2]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[2]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[30]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[30]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[31]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[31]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[3]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[3]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[4]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[4]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[5]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[5]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[6]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[6]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[7]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[7]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[8]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[8]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_read_data_M[9]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_read_data_M[9]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {rst}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {rst}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {o_mem_write_M}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[31]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[30]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[29]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[28]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[27]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[26]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[25]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[24]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[23]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[22]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[21]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[20]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[19]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[18]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[17]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[16]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[15]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[14]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[13]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[12]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[11]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[10]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[9]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[8]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[7]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[6]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[5]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[4]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[3]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[2]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[1]}]
set_load -pin_load 0.1900 [get_ports {o_data_addr_M[0]}]
set_load -pin_load 0.1900 [get_ports {o_funct3_MEM[2]}]
set_load -pin_load 0.1900 [get_ports {o_funct3_MEM[1]}]
set_load -pin_load 0.1900 [get_ports {o_funct3_MEM[0]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[31]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[30]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[29]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[28]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[27]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[26]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[25]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[24]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[23]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[22]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[21]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[20]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[19]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[18]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[17]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[16]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[15]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[14]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[13]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[12]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[11]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[10]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[9]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[8]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[7]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[6]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[5]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[4]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[3]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[2]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[1]}]
set_load -pin_load 0.1900 [get_ports {o_pc_IF[0]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[31]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[30]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[29]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[28]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[27]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[26]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[25]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[24]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[23]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[22]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[21]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[20]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[19]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[18]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[17]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[16]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[15]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[14]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[13]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[12]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[11]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[10]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[9]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[8]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[7]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[6]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[5]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[4]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[3]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[2]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[1]}]
set_load -pin_load 0.1900 [get_ports {o_write_data_M[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
