###############################################################################
# Created by write_sdc
# Sat Nov  9 01:01:59 2024
###############################################################################
current_design uart_wbs_bridge
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_start_rx}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_start_rx}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {i_uart_rx}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {i_uart_rx}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {rst}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {rst}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_ack_i}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_ack_i}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[0]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[0]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[10]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[10]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[11]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[11]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[12]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[12]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[13]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[13]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[14]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[14]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[15]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[15]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[16]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[16]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[17]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[17]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[18]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[18]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[19]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[19]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[1]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[1]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[20]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[20]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[21]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[21]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[22]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[22]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[23]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[23]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[24]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[24]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[25]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[25]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[26]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[26]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[27]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[27]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[28]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[28]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[29]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[29]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[2]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[2]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[30]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[30]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[31]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[31]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[3]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[3]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[4]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[4]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[5]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[5]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[6]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[6]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[7]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[7]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[8]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[8]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {wb_dat_i[9]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {wb_dat_i[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {o_uart_tx}]
set_load -pin_load 0.1900 [get_ports {wb_cyc_o}]
set_load -pin_load 0.1900 [get_ports {wb_stb_o}]
set_load -pin_load 0.1900 [get_ports {wb_we_o}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[15]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[14]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[13]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[12]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[11]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[10]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[9]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[8]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[7]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[6]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[5]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[4]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[3]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[2]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[1]}]
set_load -pin_load 0.1900 [get_ports {wb_adr_o[0]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[31]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[30]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[29]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[28]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[27]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[26]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[25]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[24]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[23]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[22]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[21]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[20]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[19]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[18]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[17]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[16]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[15]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[14]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[13]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[12]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[11]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[10]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[9]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[8]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[7]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[6]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[5]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[4]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[3]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[2]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[1]}]
set_load -pin_load 0.1900 [get_ports {wb_dat_o[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
